Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །ཡང་དག་པའི་རྟོག་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་དང་ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་སྤོང་བར་འགྱུར་རོ།
en: Right resolve is a gateway to the light of the Dharma, for it leads one to relinquish all thoughts, concepts, and ideas.

source: །ཡང་དག་པའི་ངག་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཡི་གེ་དང་སྒྲ་དང་། སྐད་དང་ཚིག་གི་ལམ་ཐམས་ཅད་བྲག་ཅ་དང་མཉམ་པ་ཉིད་དུ་རྟོགས་པར་འགྱུར་རོ།
en: Right speech is a gateway to the light of the Dharma, for it leads one to realize that all words, sounds, language, and speech are like echoes.

source: །ཡང་དག་པའི་ལས་ཀྱི་མཐའ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ལས་མེད་ཅིང་རྣམ་པར་སྨིན་པ་མེད་པར་འགྱུར་རོ།
en: Right action is a gateway to the light of the Dharma, for it leads to the absence of karma and the absence of ripening.

source: །ཡང་དག་པའི་འཚོ་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཚོལ་བ་ཐམས་ཅད་རྒྱུན་ཆད་པར་འགྱུར་རོ།
en: Right livelihood is a gateway to the light of the Dharma, for it leads one to cease all pursuits.

source: །ཡང་དག་པའི་རྩོལ་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཕ་རོལ་གྱི་ངོགས་སུ་ཕྱིན་པར་འགྱུར་རོ།
en: Right effort is a gateway to the light of the Dharma, for it leads one to reach the other shore.

source: །ཡང་དག་པའི་དྲན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱེད་པ་མེད་པར་འགྱུར་རོ།
en: Right mindfulness is a gateway to the light of the Dharma, for it leads to the absence of mindlessness and mental engagements.

source: །ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སེམས་མི་འཁྲུགས་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་རོ།
en: Right absorption is a gateway to the light of the Dharma, for it leads to the attainment of the absorption of an undisturbed mind.

source: །བྱང་ཆུབ་ཀྱི་སེམས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། དཀོན་མཆོག་གསུམ་གྱི་རིགས་རྒྱུན་མི་འཆད་པར་འགྱུར་རོ།
en: The mind of awakening is a gateway to the light of the Dharma, for it ensures the continuity of the line of the Three Jewels.

source: །བསམ་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཐེག་པ་དམན་པ་ལ་འདོད་པ་མེད་པར་འགྱུར་རོ།
en: Intention is a gateway to the light of the Dharma, for it leads to a lack of desire for the Lesser Vehicle.

source: །ལྷག་པའི་བསམ་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་ཆེན་པོ་ལ་ལྷག་པར་དམིགས་པར་འགྱུར་རོ།
en: Superior intention is a gateway to the light of the Dharma, for it leads to a distinct focus on the vast Buddhadharma.

source: །སྦྱོར་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Application is a gateway to the light of the Dharma, for it leads to the perfection of all virtuous qualities.

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། མཚན་དང་དཔེ་བྱད་བཟང་པོ་དང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་འགྱུར་ཞིང་སེར་སྣ་ཅན་གྱི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ།
en: The perfection of generosity is a gateway to the light of the Dharma, for it leads to the sublime marks and signs, to the complete purity of the buddha realms, and to the thorough ripening of those sentient beings that are greedy.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། མི་ཁོམ་པ་དང་ངན་འགྲོ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་ཞིང་ཚུལ་ཁྲིམས་འཆལ་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ།
en: The perfection of discipline is a gateway to the light of the Dharma, for it enables one to transcend all the restricted and lower states of existence and to ripen those sentient beings with lax discipline.

source: །བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། གནོད་སེམས་དང་། ཐ་བ་དང་། ཞེ་སྡང་དང་། ང་རྒྱལ་དང་། དྲེགས་པ་དང་། རྒྱགས་པ་སྤོང་བར་འགྱུར་ཞིང་གནོད་སེམས་ཅན་གྱི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ།
en: The perfection of patience is a gateway to the light of the Dharma, for it enables one to relinquish malice, aggression, anger, pride, arrogance, and conceit, and to ripen those sentient beings that harbor malice.

source: །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། དགེ་བའི་ཆོས་བརྩམས་པ་ཐམས་ཅད་ཉམས་སུ་ལོན་པར་འགྱུར་ཞིང་། ལེ་ལོ་ཅན་གྱི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ།
en: The perfection of diligence is a gateway to the light of the Dharma, for it enables one to practice all virtuous endeavors and to ripen those sentient beings that are lazy.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། བསམ་གཏན་དང་མངོན་པར་ཤེས་པ་ཐམས་ཅད་བསྐྱེད་ཅིང་སེམས་གཡེངས་པ་ཅན་གྱི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ།
en: The perfection of concentration is a gateway to the light of the Dharma, for it enables one to give rise to all states of equipoise and superknowledge and to ripen those sentient beings that are distracted.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། མ་རིག་པ་དང་གཏི་མུག་གི་མུན་པ་མུན་ནག་དང་། དམིགས་པའི་ལྟ་བ་སྤོང་ཞིང་ཤེས་རབ་འཆལ་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་འགྱུར་རོ།
en: The perfection of knowledge is a gateway to the light of the Dharma, for it enables one to relinquish the dark fog of ignorance and stupidity, to abandon incorrect views, and to ripen sentient beings with incorrect knowledge.

source: །ཐབས་མཁས་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སེམས་ཅན་ཇི་ལྟར་མོས་པ་བཞིན་དུ་སྤྱོད་ལམ་སྟོན་ཅིང་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་བསྒྲུབ་པར་འགྱུར་རོ།
en: Skillful means are gateways to the light of the Dharma, for they enable one to teach modes of conduct that accord with the interests of sentient beings and to practice all the teachings of the Buddha.

source: །བསྡུ་བའི་དངོས་པོ་བཞི་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སེམས་ཅན་ཐམས་ཅད་སྡུད་ཅིང་བྱང་ཆུབ་བརྙེས་པ་ལས་ཆོས་ནོད་པར་འགྱུར་རོ།
en: The four means of attracting disciples are gateways to the light of the Dharma, for they gather sentient beings and turn them into suitable recipients for the Dharma that comes from the discovery of awakening.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། བདག་གི་བདེ་བ་ལ་མི་ཆགས་ཤིང་ཡོངས་སུ་སྐྱོ་བ་མེད་པར་འགྱུར་རོ།
en: Ripening sentient beings is a gateway to the light of the Dharma, for it enables one to not be attached to one’s own happiness and to be free from discouragement.

source: །དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་སྤོང་བར་འགྱུར་རོ།
en: Grasping the true Dharma is a gateway to the light of the Dharma, for it enables one to eliminate the afflictions of all sentient beings.

source: །བསོད་ནམས་ཀྱི་ཚོགས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ཉེ་བར་འཚོ་བར་འགྱུར་རོ།
en: The accumulation of merit is a gateway to the light of the Dharma, for it enables one to nurture all sentient beings.

source: །ཡེ་ཤེས་ཀྱི་ཚོགས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སྟོབས་བཅུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: The accumulation of wisdom is a gateway to the light of the Dharma, for it perfects the ten powers.

source: །ཞི་གནས་ཀྱི་ཚོགས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་རོ།
en: The accumulation of calm abiding is a gateway to the light of the Dharma, for it leads to the attainment of the absorption of the thus-gone ones.

source: །ལྷག་མཐོང་གི་ཚོགས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཤེས་རབ་ཀྱི་མིག་ཐོབ་པར་འགྱུར་རོ།
en: The accumulation of insight is a gateway to the light of the Dharma, for it leads to the attainment of the eye of knowledge.

source: །སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་འཇུག་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཆོས་ཀྱི་མིག་ཐོབ་པར་འགྱུར་རོ།
en: Accessing authentic discerning awareness is a gateway to the light of the Dharma, for it leads to the attainment of the eye of Dharma.

source: །རྟོན་པ་ལ་འཇུག་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སངས་རྒྱས་ཀྱི་སྤྱན་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: Accessing the trustworthy is a gateway to the light of the Dharma, for it leads to the purity of the eye of the Buddha.

source: །གཟུངས་ཐོབ་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སངས་རྒྱས་ཀྱིས་གསུངས་པ་ཐམས་ཅད་འཛིན་པར་འགྱུར་རོ།
en: The attainment of dhāraṇī is a gateway to the light of the Dharma, for it enables one to retain everything said by the Buddha.

source: །སྤོབས་པ་ཐོབ་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལེགས་པར་བཤད་པས་ཚིམ་པར་བྱེད་པར་འགྱུར་རོ།
en: The attainment of confidence is a gateway to the light of the Dharma, for it enables one to satisfy all sentient beings by offering them clear explanations.

source: །རྗེས་སུ་འཐུན་པའི་ཆོས་ཀྱི་བཟོད་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དང་འཐུན་པར་འགྱུར་རོ།
en: Acceptance of the concordant Dharma is a gateway to the light of the Dharma, for it leads to being in accord with the entirety of the Buddhadharma.

source: །མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ལུང་བསྟན་པ་ཐོབ་པར་འགྱུར་རོ།
en: Acceptance of the Dharma of nonarising is a gateway to the light of the Dharma, for it leads to the attainment of prophecy.

source: །ཕྱིར་མི་ལྡོག་པའི་ས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: The ground of nonreturning is a gateway to the light of the Dharma, for it leads to the complete perfection of the entirety of the Buddhadharma.

source: །ས་ནས་སར་འཕར་བའི་ཡེ་ཤེས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱིས་དབང་བསྐུར་བར་འགྱུར་རོ།
en: The wisdom that evolves from ground to ground is a gateway to the light of the Dharma, for it leads to being empowered with the wisdom of omniscience.

source: །དབང་བསྐུར་བའི་ས་ནི་ཆོས་སྣང་བའི་སྒོ་སྟེ། མངལ་དུ་འཇུག་པ་དང་། བཙས་པ་དང་། མངོན་པར་འབྱུང་བ་དང་། དཀའ་བ་སྤྱད་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་དང་། བདུད་འདུལ་བ་དང་། བྱང་ཆུབ་རྣམ་པར་འཚང་རྒྱ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་སྟོན་པར་འགྱུར་རོ།
en: The ground of empowerment is a gateway to the light of the Dharma, for it leads one to be conceived in the womb, to be born, to manifest in the world, to undergo austerities, to go to the seat of awakening, to tame Māra, to attain complete awakening, to turn the wheel of Dharma, and to manifest great parinirvāṇa.

source: །གྲོགས་པོ་དག་འདི་དག་ནི་ཆོས་སྣང་བའི་སྒོ་བརྒྱ་རྩ་བརྒྱད་ཅེས་བྱ་བ་སྟེ། བྱང་ཆུབ་སེམས་དཔས་འཆི་འཕོ་བའི་དུས་ཀྱི་ཚེ་ལྷའི་འཁོར་དུ་གདོན་མི་ཟ་བར་གང་བསྟན་པར་བྱ་བའོ།
en: “These, friends, are known as the 108 gateways to the light of the Dharma, which a bodhisattva must teach to the assembly of gods at the time of his passing.”

source: །དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔས་ཆོས་སྣང་བའི་སྒོའི་ལེའུ་འདི་བསྟན་པའི་ཚེ། ལྷའི་འཁོར་དེ་དག་ལས་ལྷའི་བུ་བརྒྱད་ཁྲི་བཞི་སྟོང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ།
en: Monks, when the Bodhisattva taught this chapter, “The Gateways to the Light of the Dharma,” out of the assembly of gods, 84,000 gods gave rise to the mind of unexcelled, perfect, and complete awakening.

source: །ལྷའི་བུ་སྔོན་ཡོངས་སུ་སྦྱངས་པ་བྱས་པ་སུམ་ཁྲི་ཉིས་སྟོང་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: The 32,000 gods who had previously been trained gained acceptance that phenomena are nonarising.

source: །ལྷའི་བུ་བྱེ་བ་སུམ་ཅུ་རྩ་དྲུག་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ།
en: The 360 million gods gained the pure eye regarding phenomena, unblemished and untainted.

source: །དགའ་ལྡན་གྱི་གནས་ཐམས་ཅད་ཀྱང་ལྷའི་མེ་ཏོག་གིས་པུས་མོ་ནུབ་ཙམ་དུ་ཡོག་པར་གྱུར་ཏོ།
en: The entire fine realm of the Heaven of Joy was covered knee deep in celestial flowers.

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའས་ལྷའི་འཁོར་དེ་དག་རྒྱ་ཆེར་དགའ་བར་བྱ་བའི་ཕྱིར། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: Monks, at that time the Bodhisattva uttered these verses in order to bring even more joy to the assembly of gods:

source: གང་གི་ཚེ་ན་དགའ་ལྡན་གནས་མཆོག་ནས། །འདྲེན་པ་སྐྱེས་བུ་སེང་གེ་འཆི་འཕོའི་ཚེ།
en: At the time that the Guide, the Lion of Men, passes away And descends from the supreme realm of the Heaven of Joy,

source: །ལྷ་རྣམས་དག་ལ་ཚིག་ཏུ་སྨྲ་བ་ནི།
en: He proclaims these words to the gods:

source: །བག་མེད་མཐའ་དག་རྣམ་པར་སྤོངས་ཞེས་སྨྲ།
en: “Abandon all forms of mindlessness!

source: །ལྷ་ཡི་དགའ་བ་རྣམ་མང་ཇི་སྙེད་པ།
en: “The multitude of divine pleasures,

source: །ཡིད་ཀྱིས་བསམས་པས་འབྱུང་བ་དཔལ་ལྡན་པ།
en: All wonderful things conjured up by the mind,

source: །ཐམས་ཅད་ལས་དགེའི་རྒྱུ་ལས་བྱུང་བ་སྟེ། །དེ་ནི་དགེ་བའི་ལས་ཀྱི་འབྲས་བུ་ཡིན། །
en: All of this is caused by virtuous actions. So listen now to learn about these actions.

source: དེ་ལྟ་བས་ན་བྱས་པ་གཟོ་བར་གྱིས། །སྔོན་གྱི་དགེ་བསགས་འདི་ནི་ཟད་གྱུར་ཏེ། །གང་དུ་མི་བདེ་སྡུག་བསྔལ་མྱོང་འགྱུར་བ། །ངན་སོང་དག་ཏུ་སོང་བར་གྱུར་ཏ་རེ།
en: “Acknowledge the kindness done to you. Do not fall back into the three lower realms After exhausting your previous stores of merit; There is only unhappiness and suffering there.

source: །ང་ལ་གུས་པར་བྱ་བ་བསྐྱེད་ནས་ནི། །ཆོས་གང་ཐོས་པར་གྱུར་པ་དེ་དག་ལ། །ནན་ཏན་གྱིས་ནི་རབ་ཏུ་སྒྲུབས་ཤིག་དང་། །བདེ་བ་མཐའ་ཡས་ངེས་པར་ཐོབ་པར་འགྱུར།
en: “Once you develop respect for me, Apply yourselves earnestly to practicing The teachings that you have heard, And you will inevitably attain boundless joy.

source: །འདོད་པ་ཐམས་ཅད་མི་རྟག་བརྟན་པ་མིན། །ཐེར་ཟུག་མ་ཡིན་རྨི་ལམ་འདྲ་བ་སྟེ། །
en: “All desirable things are impermanent and unstable; Nothing is eternal, not even the eons.

source: སྨིག་རྒྱུ་དང་ནི་སྒྱུ་མ་རྣམས་དང་འདྲ།
en: Everything is like a mirage or an illusion,

source: །གློག་དང་དབུ་བ་འདྲ་ཞིང་འགྱུར་བ་ཡིན།
en: And as fleeting as lightning or a water bubble.

source: །འདོད་པའི་ཡོན་ཏན་དག་གི་དགའ་བས་ནི།
en: “The pleasure brought about by the qualities

source: །ལན་ཚྭའི་ཆུ་འཐུངས་བཞིན་དུ་ངོམས་མི་འགྱུར། །གང་དག་རྡུལ་མེད་འཇིག་རྟེན་འདས་པ་ཡི། །ཤེས་རབ་ལྡན་པ་དེ་དག་ངོམས་པར་འགྱུར།
en: Of desirable things is as unsatisfying as drinking salt water, But those with noble pristine knowledge That transcends the world are satisfied.

source: །ལྷ་མོ་དག་དང་འགྲོགས་དང་གླུ་དབྱངས་ནི།
en: “Goddesses, companions, and beautiful songs

source: །གར་གྱི་ལྟད་མོ་པ་དང་མཚུངས་ཤིང་འདྲ།
en: Are like the audience of a play.

source: །དཔེར་ན་འདུས་པ་དག་ནི་ཁྲི་ལས་སུ། །ཕན་ཚུན་འགྲོ་བར་སྦྱོར་བར་བྱེད་དང་མཚུངས། །
en: They are like a crowd of people who assemble And then go their own separate ways.

source: དགེ་བའི་ལས་བྱས་རྗེས་སུ་འབྲང་བྱེད་ཅིང་། །ཕྱི་བཞིན་འགྲོ་བར་བྱེད་པ་མ་གཏོགས་པར། །འདུས་བྱས་དག་ལ་གྲོགས་ཡོད་མ་ཡིན་ཏེ། །མཛའ་བཤེས་ཉེ་དུ་མེད་ཅིང་འཁོར་ཀྱང་མེད།
en: “In the realm of the conditioned, there are no allies, No friends, no relatives, and no retinue. And besides, the karma that results from good deeds Also binds one, and ever follows behind one’s back.

source: །དེ་ལྟ་བས་ན་ལྷན་ཅིག་འཐུན་བྱོས་ལ། །ཕན་ཚུན་བྱམས་སེམས་ཕན་པའི་སེམས་བྱོས་ཏེ། །ཆོས་ཀྱི་སྤྱད་པ་དག་ནི་སྤྱད་པར་གྱིས། །སྤྱད་པ་ལེགས་པར་སྤྱད་ལ་གདུང་བ་མེད།
en: “Therefore be harmonious with one another; Act with a loving and benevolent mind. Engage in wholesome activities, For actions done well bring no torment.

source: །ཐོས་དང་ཚུལ་ཁྲིམས་སྦྱིན་ལ་དགའ་གྱུར་ཅིང་། །བཟོད་དང་དེས་པ་ཕུན་སུམ་ཚོགས་ཀྱིས་ཏེ། །སངས་རྒྱས་དང་ནི་ཆོས་དང་དགེ་འདུན་དང་། །དེ་བཞིན་བག་ཡོད་པ་དག་དྲན་པར་གྱིས།
en: “Please recall the Buddha, Dharma, and Saṅgha, And do not slip into heedlessness. Those who delight in study, discipline, and generosity Are endowed with patience and gentleness.

source: །རྟག་པ་མེད་ཅིང་སྡུག་བསྔལ་བདག་མེད་ལ། །རྒྱུ་དང་རྐྱེན་རྣམས་དག་ནི་ལྡན་གྱུར་ཅིང་།
en: “Investigate suffering, impermanence, and lack of self; Examine these three phenomena thoroughly.

source: །བདག་པོ་མེད་ལ་བེམས་པོར་གྱུར་པ་ཡི། །ཆོས་འདི་དག་ལ་ཚུལ་བཞིན་བརྟག་པར་གྱིས།
en: They occur in connection to causes and conditions; They are void of life and have no owner.

source: །ང་ལ་རྫུ་འཕྲུལ་དག་ནི་གང་ཡོད་དང་། །སྤོབས་པ་ཡེ་ཤེས་དབང་རྣམས་གང་ཐོབ་པ།
en: “Whatever miraculous powers you see in me, And whatever eloquence, wisdom, and qualities I may have,

source: །ཀུན་ཀྱང་ལས་དགེའི་རྒྱུ་ལས་བྱུང་བ་སྟེ།
en: All of this is caused by virtuous deeds

source: །ཐོས་དང་ཚུལ་ཁྲིམས་བག་ཡོད་རྣམས་ལས་བྱུང་།
en: Arising from study, discipline, and conscientiousness.

source: །སེམས་ཅན་དོན་དང་ཕན་དང་བྱམས་དོན་དུ།
en: “For the welfare, benefit, and love of sentient beings,

source: །ང་ཡི་ཚུལ་ཁྲིམས་དང་ནི་ཐོས་པ་དང་། །བག་ཡོད་པ་དང་སྦྱིན་དང་དུལ་བ་དང་། །ཡང་དག་སྡོམ་པའི་རྗེས་སུ་བསླབ་པར་གྱིས།
en: You should emulate me with your discipline, study, Conscientiousness, generosity, Restraint, and self-control.

source: །ངག་དང་སྐད་དང་སྒྲ་རྣམས་ཙམ་གྱིས་ནི། །དགེ་བའི་ཆོས་རྣམས་སྒྲུབ་པར་མི་ནུས་ཀྱིས།
en: “For you will not be able to accomplish the auspicious teachings By the mere sound of your voice and speech.

source: །ནན་ཏན་སྙིང་པོར་བྱ་བས་སྒྲུབ་བྱོས་ལ། །ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱ་བར་བྱོས།
en: Please adopt the right conduct And practice what you teach.

source: །གཞན་གྱིས་གླེང་བའི་སྐབས་ནི་མ་དབྱེ་བར། །བདག་ནི་རྟག་ཏུ་བསྒྲིམས་པས་འབད་པར་གྱིས།
en: “Do not simply follow what other people say; Exert yourself with continuous concentration.

source: །ལ་ལས་བྱས་ཤིང་སྦྱིན་པ་ཡོད་མ་ཡིན། །མ་བྱས་པར་ཡང་འགྲུབ་པར་འགྱུར་བ་མེད།
en: When acting, one takes the opportunity; Without acting, one does not accomplish anything.

source: །སྔོན་ཆད་འཁོར་བར་འཁོར་ཚེ་སྡུག་བསྔལ་དག །མྱོང་བར་གང་གྱུར་དེ་ནི་དྲན་པར་གྱིས།
en: “Recall all the suffering you have experienced Circling through cyclic existence until now.

source: །ཁྱེད་ཅག་ལོག་པ་ཉིད་དུ་ངེས་པས་ན། །མྱ་ངན་འདས་དང་འདོད་ཆགས་བྲལ་མ་ཐོབ།
en: If you fall prey to distortions, Nirvāṇa and freedom from attachment will not be achieved.

source: །དེ་ལྟ་བས་ན་དལ་དང་བཤེས་གཉེན་དང་། །ཚུལ་དང་འཐུན་པའི་ཡུལ་དུ་གནས་པ་དང་། །ཆོས་མཉན་དམ་པ་ཐོབ་པར་བྱས་ནས་ནི། །འདོད་ཆགས་ལ་སོགས་ཉོན་མོངས་ཞི་བར་གྱིས།
en: “Therefore, having now obtained freedom, A spiritual guide, and a conducive environment, And having met with the superior teaching of Dharma, You should pacify attachment and the other afflictions.

source: །ང་རྒྱལ་དང་ནི་རྒྱགས་དང་དྲེགས་ཐོང་ལ།
en: “Freed from pride, arrogance, and conceit,

source: །རྟག་ཏུ་མཉེན་ཞིང་དྲང་ལ་གཡོ་མེད་ཅིང་།
en: Always flexible, upright, and honest,

source: །མྱ་ངན་འདས་པར་འགྲོ་ལ་གཞོལ་བྱོས་ཏེ།
en: Dedicate yourself to reaching the transcendence of suffering

source: །ལམ་རྟོགས་བྱ་བའི་ཕྱིར་ནི་སྦྱོར་བར་གྱིས།
en: And apply yourself to realizing the path.

source: །གཏི་མུག་རྙོག་པའི་མུན་པ་ཐམས་ཅད་ཀྱང་།
en: “Disperse all the darkness and turbidity of ignorance

source: །ཤེས་རབ་སྒྲོན་མས་རྣམ་པར་བསལ་བར་གྱིས།
en: With the lamp of knowledge.

source: །བག་ལ་ཉལ་བཅས་སྐྱོན་གྱི་དྲ་བ་རྣམས།
en: Tear the net of error, with its latencies,

source: །ཡེ་ཤེས་རྡོ་རྗེ་ཡིས་ནི་རྣམ་པར་ཁྲོལ།
en: Using the vajra of wisdom.

source: །ཤིན་ཏུ་མང་པོར་སྨྲ་བ་ཅི་དགོས་ཏེ།
en: “What need is there to say many things?

source: །དོན་དང་ཡང་དག་ལྡན་པའི་ཆོས་དེ་ལ།
en: It is in your interest to follow this teaching.

source: །ཁྱེད་ཅག་གནས་པར་བྱས་པར་མ་གྱུར་ན།
en: If you do not abide by this teaching,

source: །དེ་ལ་ཆོས་ཀྱིས་ལན་པ་མ་ཡིན་ནོ།
en: Then it is not the fault of the teaching.

source: །གང་ཚེ་ངས་ནི་བྱང་ཆུབ་ཐོབ་གྱུར་ཏེ།
en: “When I attain awakening

source: །འཆི་མེད་འགྲོ་བའི་ཆོས་ཆར་འབེབས་པའི་ཚེ།
en: And shower down the teaching that leads to immortality,

source: །རྣམ་པར་དག་པའི་སེམས་དང་ལྡན་པ་ཁྱེད།
en: You, who have pure minds, should come

source: །ཆོས་ཀྱི་དམ་པ་མཉན་པའི་ཕྱིར་ཤོག་ཤིག །ཆོས་སྣང་བའི་སྒོའི་ལེའུ་སྟེ། བཞི་པའོ།། །།
en: And listen to the true Dharma.” This concludes the fourth chapter, on the gateways to the light of the Dharma.

source: དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ལྷའི་འཁོར་ཆེན་པོ་དེ་དག་ལ་ཆོས་ཀྱི་གཏམ་འདི་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་དགའ་བར་བྱས། བཟོད་པར་བྱས་ནས།
en: Monks, in that way the Bodhisattva taught this Dharma discourse to the large congregation of gods, instructed them, inspired them, delighted them, and caused them to be receptive.

source: ལྷའི་འཁོར་བཀྲ་ཤིས་དང་ལྡན་པ་རྣམས་ལ་སྨྲས་པ།
en: He then said to that assembly of fortunate gods:

source: གྲོགས་པོ་དག་ཁོ་བོ་ནི་འཛམ་བུའི་གླིང་དུ་འགྲོའོ།
en: “Friends, I will now proceed to Jambudvīpa.

source: །ཁོ་བོ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རྣམས་བསྡུ་བའི་དངོས་པོ་སྦྱིན་པ་དང་། སྙན་པར་སྨྲ་བ་དང་། དོན་སྤྱད་པ་དང་། དོན་འཐུན་པར་བྱ་བ་བཞི་ལ་མགྲོན་དུ་བོས་ལ།
en: In the past when I practiced the conduct of a bodhisattva, I attracted sentient beings through the four activities of giving, pleasant speech, beneficial activity, and demonstrating consistency in speech and aims.

source: གྲོགས་པོ་དག་ད་ཁོ་བོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་འདུག་པ་དེ་ནི་ཁོ་བོས་བྱས་པ་མ་ཤེས་ཤིང་རིགས་པ་མ་ཡིན་པར་འགྱུར་རོ།
en: But friends, I would be acting without gratitude, and it would be inappropriate, if I were not now to achieve unexcelled, perfect, and complete awakening.”

source: །དེ་ནས་དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་ངུ་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་རྐང་པ་གཉིས་ལ་འཇུས་ཏེ། འདི་སྐད་ཅེས་འཛེར་ཏོ།
en: Hearing that, the gods of the Heaven of Joy wept and embraced the feet of the Bodhisattva.

source: །སྐྱེས་བུ་དམ་པ་ཁྱོད་མི་བཞུགས་ན་དགའ་ལྡན་གྱི་གནས་འདི་མཛེས་པར་མི་འགྱུར་རོ།
en: They said, “Virtuous One, without you, this Heaven of Joy will lose its splendor.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་ལྷའི་འཁོར་ཆེན་པོ་དེ་དག་ལ་འདི་སྐད་དུ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་འདི་ཁྱེད་ལ་ཆོས་སྟོན་པར་འགྱུར་རོ་ཞེས་དེ་སྐད་སྨྲས་ཏེ། དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་རང་གི་མགོ་ལས་ཐོད་དང་ཅོད་པན་ཕོག་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་མགོ་ལ་བཞག་ནས་འདི་སྐད་དུ། སྐྱེས་བུ་དམ་པ་ཁྱོད་ནི་ངའི་འོག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: To this, the Bodhisattva replied to the great retinue of gods, “The bodhisattva Maitreya will teach you the Dharma.” He then took the crown from his own head and placed it on the head of the bodhisattva Maitreya, saying, “You, virtuous one, shall awaken to perfect and complete buddhahood after me.”

source: ཞེས་དེ་སྐད་སྨྲས་ཏེ། དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དགའ་ལྡན་གྱི་གནས་དམ་པར་དབང་བསྐུར་ནས།
en: Thus it was that the Bodhisattva enthroned the bodhisattva Maitreya in the Heaven of Joy.

source: ཡང་ལྷའི་འཁོར་ཆེན་པོ་དེ་དག་ལ་སྨྲས་པ། གྲོགས་པོ་དག་ཁོ་བོས་ཇི་ལྟ་བུའི་གཟུགས་ཀྱིས་མའི་མངལ་དུ་འགྲོ་བར་བྱ།
en: Then he again spoke to the great retinue of gods: “Friends, in what form should I enter the womb of a mother?”

source: དེ་ལ་ཁ་ཅིག་ན་རེ་བྲམ་ཟེའི་ཁྱེའུའི་གཟུགས་སུ་གཤེགས་པའི་རིགས་སོ་ཞེས་ཟེར་རོ། །ལ་ལ་ན་རེ་བརྒྱ་བྱིན་གྱི་གཟུགས་སུ། ལ་ལ་ན་རེ་ཚངས་པའི་གཟུགས་སུ། ལ་ལ་ན་རེ་རྒྱལ་པོ་ཆེན་པོའི་གཟུགས་སུ། ལ་ལ་ན་རེ་རྣམ་ཐོས་ཀྱི་བུའི་གཟུགས་སུ། ལ་ལ་ན་རེ་སྒྲ་གཅན་གྱི་གཟུགས་སུ། ལ་ལ་ན་རེ་དྲི་ཟའི་གཟུགས་སུ། ལ་ལ་ན་རེ་མིའམ་ཅིའི་གཟུགས་སུ། ལ་ལ་ན་རེ་ལྟོ་འཕྱེ་ཆེན་པོའི་གཟུགས་སུ། ལ་ལ་ན་རེ་དབང་ཕྱུག་ཆེན་པོའི་གཟུགས་སུ། ལ་ལ་ན་རེ་ཟླ་བའི་གཟུགས་སུ། ལ་ལ་ན་རེ་ཉི་མའི་གཟུགས་སུ།
en: Some replied, “As a human in the form of a young brahmin.” But other gods suggested, “In the form of Śakra, or Brahmā, or a great king, or Vaiśravaṇa, or a gandharva, or a kinnara, or a mahoraga, or Maheśvara, or the moon god, or the sun god, or a garuḍa.”

source: ལ་ལ་ན་རེ་ནམ་མཁའ་ལྡིང་གི་དབང་པོའི་གཟུགས་སུ་བཞུད་པའི་རིགས་སོ་ཞེས་ཟེར་རོ།
en: There was also one of the gods of the Brahmā realm present, who was called Ugratejā.

source: །དེ་ནས་ཚངས་རིས་ཀྱི་ལྷའི་བུ་གཟི་བརྗིད་དམ་པ་ཞེས་བྱ་བ་སྔོན་དྲང་སྲོང་ལས་ཤི་འཕོས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཞིག་འདུག་པ་དེས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Having been a sage in his previous life, he had taken rebirth among the gods, where his progress toward unexcelled and perfect awakening had become irreversible. He now spoke:

source: །བྲམ་ཟེ་རྣམས་ཀྱི་གསང་སྔགས་ཀྱི་ཚིག་རིག་བྱེད་ཀྱི་བསྟན་བཅོས་ལས་ཇི་སྐད་དུ་འབྱུང་བ་དེ་ལྟ་བུའི་གཟུགས་སུ་བྱང་ཆུབ་སེམས་དཔའ་ཡུམ་གྱི་ལྷུམས་སུ་བཞུད་པའི་རིགས་སོ། །དེའང་ཅི་འདྲ་ཞེ་ན།
en: “The priests’ mantras and the treatises of the Vedas mention the proper form for a bodhisattva to take when descending into the womb of his mother. How

source: གླང་པོ་དམ་པ་ལུས་ཆེན་མཆོག་གྱུར་པ། །མཆེ་བ་དྲུག་ཅན་གསེར་གྱི་དྲ་བས་གཡོགས།
en: It should it be? “In the glorious form of an excellent, great, Six-tusked elephant, covered with golden netting, .

source: །མགོ་བོ་རབ་ཏུ་དམར་ཞིང་ཤིན་ཏུ་མཛེས།
en: Its head intensely red and very handsome,.

source: །འགྲམ་ནས་ཟག་ཅིང་གཟུགས་ལྡན་དཔལ་ལྡན་པའོ།
en: It With glistening wet cheeks: “Priests body.

source: །རིག་བྱེད་བསྟན་བཅོས་ཡང་དག་མཁས་པ་ཡི། བྲམ་ཟེས་རྣམ་པ་དེ་འདྲ་དེ་ཤེས་ནས། །སུམ་ཅུ་རྩ་གཉིས་མཚན་དང་ལྡན་འགྱུར་ཞེས། །ཡང་དག་ཉིད་དུ་ལུང་ནི་སྟོན་པར་འགྱུར།
en: Someone who are truly learned in the Vedas Will recognize such features, And will correctly foresee and announce The advent of one with the thirty-two marks.”

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་སྐྱེ་བའི་དུས་ལ་བལྟས་ནས།
en: Monks, while the Bodhisattva was still residing in the sublime Heaven of Joy, he considered the time for his birth.

source: དགའ་ལྡན་གྱི་གནས་དམ་པ་ན་གནས་བཞིན་དུ་རྒྱལ་པོ་ཟས་གཙང་མའི་ཁྱིམ་དམ་པ་དེར་སྔ་ལྟས་བརྒྱད་སྟོན་ཏོ།
en: At that time he manifested eight omens at the sublime residence of King Śuddhodana.
